code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/CommonModules/СообщенияQI/Ext/Module.bsl
Функция СлужебноеУведомлениеОФормированииЗапросаСубброкеру(ЗапросСубброкеруСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Ссылка,
	|	ЗапросСубброкеруНаРаскрытие.ВидКД.Код КАК КодКД,
	|	ЗапросСубброкеруНаРаскрытие.РеференсКД КАК КДРеференс,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Наименование КАК НаименованиеДепонента,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО.НомерДепозитарногоДоговора КАК НомерДоговора,
	|	ЗапросСубброкеруНаРаскрытие.Номер КАК НомерЗапроса,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК ДатаЗапроса
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка = &ЗапросСубброкеруСсылка");
	Запрос.УстановитьПараметр("ЗапросСубброкеруСсылка",ЗапросСубброкеруСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	ТаблицаРезультата = Результат.Выгрузить();
	СтрокаРезультата = ТаблицаРезультата[0];
	Тема =  "Сформирован запрос субброкеру на раскрытие по КД " + СтрокаРезультата.КодКД;
	Тело = "В рамках КД %КодКД% КД референс %КДРеференс% сформирован запрос субброкеру %НаименованиеДепонента% %НомерДоговора%. 
	|Запрос номер %НомерЗапроса% от %ДатаЗапроса%.";
	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		Параметр = "%" + Колонка.Имя + "%";
  		Тело = СтрЗаменить(Тело, Параметр, СтрокаРезультата[Колонка.Имя]);		
	КонецЦикла;
	Возврат Новый Структура("Тема, Тело",Тема, Тело);

КонецФункции

Функция СлужебноеУведомлениеОбИзмененииОстаткаЦБ(ЗапросСубброкеруСсылка, ЗапросСубброкеруНовыйСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Ссылка,
	|	ЗапросСубброкеруНаРаскрытие.ВидКД.Код КАК КодКД,
	|	ЗапросСубброкеруНаРаскрытие.РеференсКД КАК КДРеференс,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Наименование КАК НаименованиеДепонента,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО.НомерДепозитарногоДоговора КАК НомерДоговора,
	|	ЗапросСубброкеруНаРаскрытие.Номер КАК НомерЗапроса,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК ДатаЗапроса,
	|	ЗапросСубброкеруНаРаскрытиеНовый.Номер КАК НомерНовогоЗапроса,
	|	ЗапросСубброкеруНаРаскрытиеНовый.Дата КАК ДатаНовогоЗапроса
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие,
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытиеНовый
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка = &ЗапросСубброкеруСсылка
	|	И ЗапросСубброкеруНаРаскрытиеНовый.Ссылка = &ЗапросСубброкеруНовыйСсылка");
	Запрос.УстановитьПараметр("ЗапросСубброкеруСсылка",ЗапросСубброкеруСсылка);
	Запрос.УстановитьПараметр("ЗапросСубброкеруНовыйСсылка",ЗапросСубброкеруНовыйСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	ТаблицаРезультата = Результат.Выгрузить();
	СтрокаРезультата = ТаблицаРезультата[0];
	Тема =  "Изменились остатки ЦБ по запросу субброкера на раскрытие по КД " + СтрокаРезультата.КодКД;
	Тело = "В рамках КД %КодКД% КД референс %КДРеференс% был сформирован запрос субброкеру %НаименованиеДепонента% %НомерДоговора%. 
	|Запрос номер %НомерЗапроса% от %ДатаЗапроса%.
	|По сравнению с датой отправки изменились данные по количеству ЦБ. 
	|Сформирован новый запрос на раскрытие номер %НомерНовогоЗапроса% от %ДатаНовогоЗапроса%.";
	
	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		Параметр = "%" + Колонка.Имя + "%";
		Тело = СтрЗаменить(Тело, Параметр, СтрокаРезультата[Колонка.Имя]);		
	КонецЦикла;
	Возврат Новый Структура("Тема, Тело",Тема, Тело);

КонецФункции

Процедура ОтправитьСлужебноеУведомление(ВнешнийИсточник, Тема, Тело) Экспорт 
	
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Отправка служебного сообщения",УровеньЖурналаРегистрации.Предупреждение,,,"Не указаны параметры внешнего источника " + ВнешнийИсточник);
		Возврат;	
	КонецЕсли;
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			Тема);
	ПараметрыУведомления.Вставить("ТекстПисьма",		Тело);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры
